# Books Assignment
- Zach Hanson

## Importing Libraries

In [2]:
#pandas
import pandas as pd

#pymysql
import pymysql
pymysql.install_as_MySQLdb()

#SQLAlchemy
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

#Creating Connection
connection_str = 'mysql+pymysql://root:root@localhost/books'

In [3]:
#Creating engine
engine = create_engine(connection_str)

## Creating New Database

In [4]:
#Creating database
create_database(connection_str)

In [5]:
#Verifying it was created
database_exists(connection_str)

True

- Created successfully

### Adding Tables

In [6]:
#Reading in all the data tables
users = pd.read_csv('Data/users.csv')
books = pd.read_csv('Data/books.csv')
authors = pd.read_csv('Data/authors.csv')
favorites = pd.read_csv('Data/favorites.csv')

In [7]:
#Converting to SQL Table
users.to_sql('users', engine, if_exists='replace')
books.to_sql('books', engine, if_exists='replace')
authors.to_sql('authors', engine, if_exists='replace')
favorites.to_sql('favorites', engine, if_exists='replace')

7

## Testing Database

In [9]:
#Showing tables
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [10]:
q = '''
SELECT books.title, favorites.user_id
FROM books
INNER JOIN favorites
ON books.id = favorites.book_id
WHERE favorites.user_id = (SELECT users.id
                           FROM users
                           WHERE (users.first_name='John' AND users.last_name='Doe'));
'''
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1